
Orders_dimen.csv
- Read the Orders_dimen data into ord_df
- Display the top two rows
- Display the last three rows
- Select one row randomly
- Check the total number of entries you have
- Check the No of features
- Print features Names(Column Names)
- Check the dtype of each and every columns
- Check the "Order_Date" column type if it is object convert it into datetime
- Create two new columns Order_Year and Order_Month with year and month vcalues from Order_date
- Merge comb_data and ord_df and write the reslut into comb_data
- check the number of rows and columns in comb_data.
- In the comb_data check the value counts in "Order_Priority"
- In the comb_data check the value counts for "Order_Year"
- In which Year the customer have Highest no of orders
- In the comb_data check the value counts for Order_Month
- In which Month the customer have Highest no of orders

In [2]:
import pandas as pd
ord_df= pd.read_csv('https://raw.githubusercontent.com/sumathi16/Machine-Learning-with-Python/master/data/global_sales_data/orders_dimen.csv')
ord_df

      Order_ID  Order_Date Order_Priority    Ord_id
0            3  13-10-2010            LOW     Ord_1
1          293  01-10-2012           HIGH     Ord_2
2          483  10-07-2011           HIGH     Ord_3
3          515  28-08-2010  NOT SPECIFIED     Ord_4
4          613  17-06-2011           HIGH     Ord_5
...        ...         ...            ...       ...
5501     47360  08-10-2010  NOT SPECIFIED  Ord_5502
5502     52706  09-07-2012            LOW  Ord_5503
5503     54279  30-07-2011           HIGH  Ord_5504
5504     55558  09-08-2010         MEDIUM  Ord_5505
5505     56581  08-02-2009           HIGH  Ord_5506

[5506 rows x 4 columns]

## Display the top two rows

In [3]:
ord_df.head(2)

   Order_ID  Order_Date Order_Priority Ord_id
0         3  13-10-2010            LOW  Ord_1
1       293  01-10-2012           HIGH  Ord_2

In [4]:
ord_df.tail(3)

      Order_ID  Order_Date Order_Priority    Ord_id
5503     54279  30-07-2011           HIGH  Ord_5504
5504     55558  09-08-2010         MEDIUM  Ord_5505
5505     56581  08-02-2009           HIGH  Ord_5506

 ## 4.Select one row randomly

In [5]:
ord_df.sample()

      Order_ID  Order_Date Order_Priority    Ord_id
3788     48327  10-08-2009  NOT SPECIFIED  Ord_3789

## 5.Check the total number of entries you have

In [6]:
ord_df.shape

(5506, 4)

## 6.Check the No of features

In [7]:
ord_df.shape[1]

4

## 7.Print features Names(Column Names)

In [8]:
ord_df.columns

Index(['Order_ID', 'Order_Date', 'Order_Priority', 'Ord_id'], dtype='object')

## 8.chech the number of entries you have

In [9]:
ord_df.shape

(5506, 4)

In [10]:
ord_df.count().sum()

22024

In [11]:
ord_df.count()

Order_ID          5506
Order_Date        5506
Order_Priority    5506
Ord_id            5506
dtype: int64

## 9.Check the dtype of each and every columns

In [12]:
ord_df.dtypes

Order_ID           int64
Order_Date        object
Order_Priority    object
Ord_id            object
dtype: object

## 10.Check the "Order_Date" column type if it is object convert it into datetime

In [13]:
ord_df["Order_Date"].dtypes

dtype('O')

In [14]:
ord_df.Order_Date

0       13-10-2010
1       01-10-2012
2       10-07-2011
3       28-08-2010
4       17-06-2011
           ...
5501    08-10-2010
5502    09-07-2012
5503    30-07-2011
5504    09-08-2010
5505    08-02-2009
Name: Order_Date, Length: 5506, dtype: object

In [15]:
ord_df

      Order_ID  Order_Date Order_Priority    Ord_id
0            3  13-10-2010            LOW     Ord_1
1          293  01-10-2012           HIGH     Ord_2
2          483  10-07-2011           HIGH     Ord_3
3          515  28-08-2010  NOT SPECIFIED     Ord_4
4          613  17-06-2011           HIGH     Ord_5
...        ...         ...            ...       ...
5501     47360  08-10-2010  NOT SPECIFIED  Ord_5502
5502     52706  09-07-2012            LOW  Ord_5503
5503     54279  30-07-2011           HIGH  Ord_5504
5504     55558  09-08-2010         MEDIUM  Ord_5505
5505     56581  08-02-2009           HIGH  Ord_5506

[5506 rows x 4 columns]

## 11.Create two new columns Order_Year and Order_Month with year and month vcalues from Order_date

In [32]:
ord_df['year']=pd.DatetimeIndex(ord_df['Ord_Date'].year

SyntaxError: unexpected EOF while parsing (<ipython-input-32-c943582f9bea>, line 1)

In [36]:
ord_df

      Order_ID  Order_Date Order_Priority    Ord_id
0            3  13-10-2010            LOW     Ord_1
1          293  01-10-2012           HIGH     Ord_2
2          483  10-07-2011           HIGH     Ord_3
3          515  28-08-2010  NOT SPECIFIED     Ord_4
4          613  17-06-2011           HIGH     Ord_5
...        ...         ...            ...       ...
5501     47360  08-10-2010  NOT SPECIFIED  Ord_5502
5502     52706  09-07-2012            LOW  Ord_5503
5503     54279  30-07-2011           HIGH  Ord_5504
5504     55558  09-08-2010         MEDIUM  Ord_5505
5505     56581  08-02-2009           HIGH  Ord_5506

[5506 rows x 4 columns]

In [34]:
ord_df.columns

Index(['Order_ID', 'Order_Date', 'Order_Priority', 'Ord_id'], dtype='object')

### 12. Merge comb_data and ord_df and write the reslut into comb_data

### 13.check the number of rows and columns in comb_data.

In [38]:
ord_df.shape

(5506, 4)

### 14.In the comb_data check the value counts in "Order_Priority"

In [47]:
ord_df.describe(include=object)

        Order_Date Order_Priority    Ord_id
count         5506           5506      5506
unique        1418              5      5506
top     12-12-2010           HIGH  Ord_1026
freq            11           1137         1

###  15.In the comb_data check the value counts for "Order_Year"

In [53]:
ord_df.Order_Priority.value_counts()

HIGH             1137
LOW              1124
CRITICAL         1090
NOT SPECIFIED    1080
MEDIUM           1075
Name: Order_Priority, dtype: int64

In [54]:
ord_df

      Order_ID  Order_Date Order_Priority    Ord_id
0            3  13-10-2010            LOW     Ord_1
1          293  01-10-2012           HIGH     Ord_2
2          483  10-07-2011           HIGH     Ord_3
3          515  28-08-2010  NOT SPECIFIED     Ord_4
4          613  17-06-2011           HIGH     Ord_5
...        ...         ...            ...       ...
5501     47360  08-10-2010  NOT SPECIFIED  Ord_5502
5502     52706  09-07-2012            LOW  Ord_5503
5503     54279  30-07-2011           HIGH  Ord_5504
5504     55558  09-08-2010         MEDIUM  Ord_5505
5505     56581  08-02-2009           HIGH  Ord_5506

[5506 rows x 4 columns]

### 16.In which Year the customer have Highest no of orders